using System.Collections;
using System.Collections.Generic;
using TMPro;
using UnityEngine;

public class Dialog_NameTag : MonoBehaviour
{
    private string[] NameStrings =
  {
        //퀘스트0
        //0
        "이영신",
    
        //1
        "이영신",

        //2
        "이영신",

        //3
        "퀘스트",



        //퀘스트1 내부대신을 찾아가시오.
        //4
        "이영신",

        //5
        "내부대신",

        //6
        "이영신",

        //7
        "내부대신",

        //8
        "이영신",

        //9
        "내부대신",

        //10
        "이영신",

        //11
        "퀘스트",



        //퀘스트2 방위대장을 찾아가자.
        //12
        "이영신",

        //13
        "방위대장",

        //14
        "이영신",
        
        //15
        "방위대장",

        //16
        "방위대장",

        //17
        "이영신",

        //18
        "방위대장",

        //19
        "이영신",

        //20
        "방위대장",

        //21
        "방위대장",

        //22
        "방위대장",

        //23
        "퀘스트",



        //퀘스트3  대장간으로 이동하자.
        //24
        "대장장이",

        //25
        "이영신",

        //26
        "대장장이",

        //27
        "이영신",

        //28
        "대장장이",

        //29
        "이영신",

        //30
        "대장장이",

        //31
        "이영신",

        //32
        "대장장이",

        //33
        "대장장이",

        //34
        "대장장이",

        //35
        "대장장이",

        //36
        "이영신",

        //37
        "대장장이",

        //38
        "이영신",

        //39
        "대장장이",

        //40
        "이영신",

        //41
        "대장장이",

        //42
        "대장장이",

        //43
        "이영신",

        //44
        "대장장이",

        //45
        "이영신",

        //46
        "대장장이",

        //47
        "이영신",

        //48
        "대장장이",

        //49
        "시스템",

        //50
        "대장장이",

        //51
        "시스템",

        //52
        "퀘스트",



        //퀘스트4 흡혈귀 날개 0/30
        //퀘스트5 대장장이에게 돌아가자.
        //53
        "이영신",

        //54
        "대장장이",

        //55
        "이영신",
       
        //56
        "대장장이",

        //57
        "대장장이",

        //58
        "대장장이",

        //59
        "이영신",

        //60
        "이영신",

        //61
        "퀘스트",



        //퀘스트6 방위대장에게 돌아가자
        //62
        "방위대장",

        //63
        "이영신",

        //64
        "방위대장",

        ///65
        "이영신",

        //66
        "방위대장",

        //67
        "방위대장",

        //68
        "이영신",

        //69
        "방위대장",

        //70
        "이영신",

        //71
        "퀘스트",



        //퀘스트7 흡혈귀 토벌 0/40
        //퀘스트8 방위대장에게 보고하자.
        //72
        "이영신",

        //73
        "방위대장",

        //74
        "이영신",

        //75
        "방위대장",

        //76
        "이영신",

        //77
        "방위대장",

        //78
        "이영신",

        //79
        "이영신",

        //80
        "퀘스트",



        //퀘스트9 대장장이에게 가자.
        //81
        "대장장이",

        //82
        "이영신",

        //83
        "대장장이",

        //84
        "이영신",

        //85
        "대장장이",

        //86
        "이영신",

        //87
        "대장장이",

        //88
        "대장장이",

        //89
        "시스템",

        //90
        "이영신",

        //91
        "대장장이",

        //92
        "이영신",

        //93
        "퀘스트",



        //퀘스트10 산나비 날개 0/25
        //퀘스트11 대장장이에게 돌아가자
        //94
        "이영신",

        //95
        "대장장이",

        //96
        "이영신",

        //97
        "대장장이",

        //98
        "이영신",

        //99
        "대장장이",

        //100
        "대장장이",

        //101
        "대장장이",

        //102
        "이영신",

        //103
        "퀘스트",



        //퀘스트12 보안대장에게 돌아가자.
        //104
        "이영신",

        //105
        "방위대장",

        //106
        "이영신",

        //107
        "방위대장",

        //108
        "이영신",

        //109
        "퀘스트",



        //퀘스트13 주막주인에게 가자.
        //110
        "이영신",

        //111
        "주막주인",

        //112
        "이영신",

        //113
        "주막주인",

        //114
        "이영신",

        //115
        "주막주인",

        //116
        "이영신",

        //117
        "주막주인",

        //118
        "이영신",

        //119
        "이영신",

        //120
        "주막주인",

        //121
        "이영신",

        //122
        "주막주인",

        //123
        "이영신",

        //124
        "주막주인",

        //125
        "이영신",

        //126
        "주막주인",

        //127
        "이영신",

        //128
        "주막주인",
        
        //129
        "이영신",

        //130
        "주막주인",

        //131
        "이영신",

        //132
        "주막주인",

        //133
        "이영신",

        //134
        "퀘스트",



        //퀘스트14 산나비 0/30
        //퀘스트15 주막주인에게로 돌아가자.
        //135
        "이영신",

        //136
        "주막주인",

        //137
        "이영신",

        //138
        "주막주인",

        //139
        "이영신",
        
        //140
        "이영신",

        //140
        "퀘스트",



        //퀘스트16 보안대장에게 돌아가자.
        //141
        "이영신",

        //142
        "방위대장",

        //143
        "이영신",

        //144
        "방위대장",

        //145
        "방위대장",

        //146
        "이영신",

        //147
        "방위대장",

        //148
        "방위대장",

        //149
        "방위대장",

        //150
        "이영신",

        //151
        "방위대장",

        //152
        "이영신",

        //153
        "방위대장",

        //154
        "이영신",

        //155
        "이영신",

        //156
        "시스템",

        //157
        "퀘스트",



        //퀘스트17 도성지하를 조사해보자.
        //158
        "이영신",

        //159
        "이영신",

        //160
        "퀘스트",



        //퀘스트18 방위대장에게 돌아가자.
        //161
        "방위대장",

        //162
        "이영신",
        
        //163
        "방위대장",

        //164
        "이영신",

        //165
        "방위대장",

        //166
        "이영신",

        //167
        "퀘스트",



        //퀘스트19 대장장이에게 가자.
        //168
        "대장장이",

        //169
        "이영신",

        //170
        "대장장이",

        //171
        "이영신",

        //172
        "대장장이",

        //173
        "이영신",

        //174
        "대장장이",

        //175
        "이영신",

        //176
        "대장장이",

        //177
        "이영신",

        //178
        "퀘스트",



        //퀘스트20 호환가죽 0/25
        //퀘스트21 대장장이에게 돌아가자.
        //179
        "대장장이",

        //180
        "이영신",

        //181
        "대장장이",

        //182
        "이영신",

        //183
        "대장장이",

        //184
        "대장장이",

        //185
        "대장장이",

        //186
        "이영신",

        //187
        "시스템",

        //188
        "이영신",

        //189
        "대장장이",

        //190
        "퀘스트",
        
        
        
        //퀘스트22 도성 지하의 큰 돌을 무너뜨리자.
        //퀘스트23 도성지하를 조사하자.
        //191
        "이영신",

        //192
        "이영신",

        //193
        "퀘스트",



        //퀘스트24 열쇠를 찾아라.
        //194
        "???",

        //195
        "이영신",

        //196
        "이영신",

        //197
        "이영신",

        //198
        "이영신",

        //199
        "퀘스트",



        //퀘스트25 도깨비를 쓰러뜨려라.
        //퀘스트26 방위대장에게 돌아가자.
        //200
        "방위대장",

        //201
        "방위대장",

        //202
        "방위대장",

        //203
        "이영신",

        //204
        "방위대장",

        //205
        "이영신",

        //206
        "방위대장",

        //207
        "이영신",

        //208
        "방위대장",

        //209
        "이영신",

        //210
        "방위대장",

        //211
        "방위대장",

        //212
        "이영신",

        //213
        "방위대장",

        //214
        "이영신",

        //215
        "방위대장",

        //216
        "시스템",

        //217
        "시스템",





        //일상텍스트
        //주막주인
        //218
        "이영신",

        //219
        "주막주인",

        //220
        "이영신",



        //방위대장
        //221
        "방위대장",

        //222
        "이영신",



        //내부대신
        //223
        "내부대신",

        //224
        "이영신",



        //대장장이
        //225
        "대장장이",

        //226
        "이영신",

        //227
        "대장장이",










    };

    // Start is called before the first frame update
    void Start()
    {

    }

    // Update is called once per frame
    void Update()
    {
        GetComponent<TextMeshProUGUI>().text = NameStrings[Dialogue.index];
    }
}
